In [1]:
import numpy as np
import pandas as pd

# Missing Data

In [2]:
d = {'A':[10,20,np.nan],'B':[40,np.nan,np.nan],'C':[70,80,90]}
d

{'A': [10, 20, nan], 'B': [40, nan, nan], 'C': [70, 80, 90]}

In [3]:
df = pd.DataFrame(d)
df

      A     B   C
0  10.0  40.0  70
1  20.0   NaN  80
2   NaN   NaN  90

In [4]:
df.dropna(axis=1)

    C
0  70
1  80
2  90

In [5]:
df.dropna()

      A     B   C
0  10.0  40.0  70

In [6]:
df.dropna(thresh=2)

      A     B   C
0  10.0  40.0  70
1  20.0   NaN  80

In [7]:
df.fillna('mean')

      A     B   C
0    10    40  70
1    20  mean  80
2  mean  mean  90

In [8]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

In [9]:
df

      A     B   C
0  10.0  40.0  70
1  20.0   NaN  80
2  15.0   NaN  90

In [10]:
df['B'].fillna(value=df.iloc[0,:].sum( ))

0     40.0
1    120.0
2    120.0
Name: B, dtype: float64

In [11]:
df['B'].fillna(value=df.iloc[0,:].min( ))

0    40.0
1    10.0
2    10.0
Name: B, dtype: float64

In [12]:
df['B'].fillna(value=df.iloc[0,:].max( ))

0    40.0
1    70.0
2    70.0
Name: B, dtype: float64

In [13]:
df['D'] = df['B'].fillna(value=df.iloc[0,:].max( ))

In [14]:
df

      A     B   C     D
0  10.0  40.0  70  40.0
1  20.0   NaN  80  70.0
2  15.0   NaN  90  70.0

# Groupby In Pandas

In [15]:
data = {'Company':['GOOGLE','GOOGLE','MSFT','MSFT','FB','FB'],
       'Person':['Ram','Hari','Shyam','Hank','Carl','Angela'],
       'Sales':[200,120,340,124,243,350]}

In [16]:
daf = pd.DataFrame(data)
daf

  Company  Person  Sales
0  GOOGLE     Ram    200
1  GOOGLE    Hari    120
2    MSFT   Shyam    340
3    MSFT    Hank    124
4      FB    Carl    243
5      FB  Angela    350

In [17]:
byComp=daf.groupby('Company')

In [18]:
byComp.mean()

         Sales
Company
FB       296.5
GOOGLE   160.0
MSFT     232.0

In [19]:
byComp.sum()

         Sales
Company
FB         593
GOOGLE     320
MSFT       464

In [20]:
byComp.max()

        Person  Sales
Company
FB        Carl    350
GOOGLE     Ram    200
MSFT     Shyam    340

In [21]:
daf.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [22]:
daf.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOGLE    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [23]:
daf.groupby('Company').describe().loc['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [24]:
daf.groupby('Company').describe().iloc[2:3,:]

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
MSFT      2.0  232.0  152.735065  124.0  178.0  232.0  286.0  340.0

In [25]:
daf.groupby('Company').describe().transpose()

Company              FB      GOOGLE        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [26]:
daf.groupby('Company').describe().transpose()['GOOGLE']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOGLE, dtype: float64

In [27]:
daf.groupby('Company').describe().transpose().iloc[:,1:2]

Company          GOOGLE
Sales count    2.000000
      mean   160.000000
      std     56.568542
      min    120.000000
      25%    140.000000
      50%    160.000000
      75%    180.000000
      max    200.000000

# Combining DataFrames

In [28]:
#There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenating. 
#In this lecture we will discuss these 3 methods with examples.

In [29]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [30]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [31]:
df3 = pd.DataFrame({'E': ['E1', 'E2', 'E3', 'E4'],
                    'F': ['F1', 'F2', 'F3', 'F4'],
                    'G': ['G3', 'G2', 'G3', 'G4'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [32]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [33]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [34]:
df3

     E   F   G    D
8   E1  F1  G3   D8
9   E2  F2  G2   D9
10  E3  F3  G3  D10
11  E4  F4  G4  D11

In [35]:
#Concatenating DataFrames

In [36]:
pd.concat([df1,df2,df3])

      A    B    C    D    E    F    G
0    A0   B0   C0   D0  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN
4    A4   B4   C4   D4  NaN  NaN  NaN
5    A5   B5   C5   D5  NaN  NaN  NaN
6    A6   B6   C6   D6  NaN  NaN  NaN
7    A7   B7   C7   D7  NaN  NaN  NaN
8   NaN  NaN  NaN   D8   E1   F1   G3
9   NaN  NaN  NaN   D9   E2   F2   G2
10  NaN  NaN  NaN  D10   E3   F3   G3
11  NaN  NaN  NaN  D11   E4   F4   G4

In [37]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    E    F    G    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   E1   F1   G3   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   E2   F2   G2   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   E3   F3   G3  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   E4   F4   G4  D11

In [38]:
#Merging DataFrames

how : {'left', 'right', 'outer', 'inner'}, default 'inner'
    Type of merge to be performed.

    * left: use only keys from left frame, similar to a SQL left outer join;
      preserve key order.
    * right: use only keys from right frame, similar to a SQL right outer join;
      preserve key order.
    * outer: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically.
    * inner: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys.

In [39]:
pd.merge(df2,df3,how='outer',on= 'D')

     A    B    C    D    E    F    G
0   A4   B4   C4   D4  NaN  NaN  NaN
1   A5   B5   C5   D5  NaN  NaN  NaN
2   A6   B6   C6   D6  NaN  NaN  NaN
3   A7   B7   C7   D7  NaN  NaN  NaN
4  NaN  NaN  NaN   D8   E1   F1   G3
5  NaN  NaN  NaN   D9   E2   F2   G2
6  NaN  NaN  NaN  D10   E3   F3   G3
7  NaN  NaN  NaN  D11   E4   F4   G4

In [40]:
pd.merge(df1,df2, how='outer', on=['C','D'])

   A_x  B_x   C   D  A_y  B_y
0   A0   B0  C0  D0  NaN  NaN
1   A1   B1  C1  D1  NaN  NaN
2   A2   B2  C2  D2  NaN  NaN
3   A3   B3  C3  D3  NaN  NaN
4  NaN  NaN  C4  D4   A4   B4
5  NaN  NaN  C5  D5   A5   B5
6  NaN  NaN  C6  D6   A6   B6
7  NaN  NaN  C7  D7   A7   B7

In [41]:
pd.merge(df1,df2, how='left', on=['C','D'])

  A_x B_x   C   D  A_y  B_y
0  A0  B0  C0  D0  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN
2  A2  B2  C2  D2  NaN  NaN
3  A3  B3  C3  D3  NaN  NaN

In [42]:
pd.merge(df1,df2, how='right', on=['C','D'])

   A_x  B_x   C   D A_y B_y
0  NaN  NaN  C4  D4  A4  B4
1  NaN  NaN  C5  D5  A5  B5
2  NaN  NaN  C6  D6  A6  B6
3  NaN  NaN  C7  D7  A7  B7

In [43]:
#Joining Dataframes

In [44]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2'])

In [45]:
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3'],
                      'E': ['E0', 'E2', 'E3']},
                      index=['K0', 'K2', 'K3'])

In [46]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [47]:
right

     C   D   E
K0  C0  D0  E0
K2  C2  D2  E2
K3  C3  D3  E3

In [48]:
left.join(right)

     A   B    C    D    E
K0  A0  B0   C0   D0   E0
K1  A1  B1  NaN  NaN  NaN
K2  A2  B2   C2   D2   E2

In [49]:
right.join(left, how='left')

     C   D   E    A    B
K0  C0  D0  E0   A0   B0
K2  C2  D2  E2   A2   B2
K3  C3  D3  E3  NaN  NaN

In [50]:
right.join(left, how='right')

      C    D    E   A   B
K0   C0   D0   E0  A0  B0
K1  NaN  NaN  NaN  A1  B1
K2   C2   D2   E2  A2  B2

In [51]:
right.join(left, how='inner')

     C   D   E   A   B
K0  C0  D0  E0  A0  B0
K2  C2  D2  E2  A2  B2

In [52]:
right.join(left, how='outer')

      C    D    E    A    B
K0   C0   D0   E0   A0   B0
K1  NaN  NaN  NaN   A1   B1
K2   C2   D2   E2   A2   B2
K3   C3   D3   E3  NaN  NaN

# Miscellaenous Operation

In [73]:
dafr = pd.DataFrame({'col1':[1,2,3,4],
                     'col2':[44,55,66,44],
                     'col3':['abc','ghi','def','xyz']
                    })
dafr

   col1  col2 col3
0     1    44  abc
1     2    55  ghi
2     3    66  def
3     4    44  xyz

In [74]:
dafr['col2'].unique()

array([44, 55, 66], dtype=int64)

In [75]:
dafr['col2'].nunique()

3

In [76]:
dafr['col2'].value_counts()

44    2
55    1
66    1
Name: col2, dtype: int64

In [77]:
def times3(x):
    return x*3

In [78]:
dafr['col2'].sum()

209

In [79]:
dafr['col2'].mean()

52.25

In [80]:
dafr['col2'].apply(times3)

0    132
1    165
2    198
3    132
Name: col2, dtype: int64

In [81]:
dafr['col2'].apply(lambda x:x*3)

0    132
1    165
2    198
3    132
Name: col2, dtype: int64

In [82]:
dafr.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [83]:
dafr.index

RangeIndex(start=0, stop=4, step=1)

In [84]:
dafr.sort_values('col2')

   col1  col2 col3
0     1    44  abc
3     4    44  xyz
1     2    55  ghi
2     3    66  def

In [85]:
dafr.sort_values('col3')

   col1  col2 col3
0     1    44  abc
2     3    66  def
1     2    55  ghi
3     4    44  xyz

In [87]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
        'B':['one','one','two','two','one','one'],
        'C':['x','y','x','y','x','y'],
        'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [88]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [89]:
df.pivot_table(values='D',index=['A','C'],columns='B')

B      one  two
A   C
bar x  4.0  NaN
    y  1.0  5.0
foo x  1.0  2.0
    y  3.0  NaN